---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallWidth
source: html/d0124aee-f06a-ba36-1f50-426e7afdc9f5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallWidth Property

"Overall Width": Overall Width

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetOverallWidth { get; }
```